# 02.파이썬라이브러리-Pandas

## Pandas 설치하기

In [ ]:
!pip install pandas

## Pandas 사용

In [1]:
import pandas as pd

pd.__version__

'1.3.0'

## Pandas 사용 사례

### 1. 딕셔너리 데이터를 DataFrame 데이터로 보여주기

In [28]:
import pandas as pd

datas = {2004:[472761,108.2], 2005:[435031,107.8], 2006:[448153,107.5], 
         2007:[493183,106.2], 2008:[465891,106.4], 2009:[444849,106.4],
         2010:[470171,106.9], 2011:[471265,105.7], 2012:[484550,105.7]}

df = pd.DataFrame(datas, index=['출생아수', '출생성비'])
df.columns.name = '년도'
df

년도,2004,2005,2006,2007,2008,2009,2010,2011,2012
출생아수,472761.0,435031.0,448153.0,493183.0,465891.0,444849.0,470171.0,471265.0,484550.0
출생성비,108.2,107.8,107.5,106.2,106.4,106.4,106.9,105.7,105.7

### 2. 사이킷런 빌트인 데이터셋 DataFrame 데이터로 보여주기

In [29]:
# 사이킷런 빌트인 데이터셋(sklearn.datasets): 붓꽃
from sklearn.datasets import load_iris

iris = load_iris()

df = pd.DataFrame(iris['data'], columns=iris['feature_names'])
df

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                  5.1               3.5                1.4               0.2
1                  4.9               3.0                1.4               0.2
2                  4.7               3.2                1.3               0.2
3                  4.6               3.1                1.5               0.2
4                  5.0               3.6                1.4               0.2
..                 ...               ...                ...               ...
145                6.7               3.0                5.2               2.3
146                6.3               2.5                5.0               1.9
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

[150 rows x 4 columns]

### 3. csv 파일 읽어와서 DataFrame 데이터로 보여주기
- https://www.kaggle.com/datasets/uciml/iris 데이터 다운로드

In [30]:
import pandas as pd

df = pd.read_csv('data/iris.csv')
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

------

## 1. Pandas 데이터 구조

### 1. Series 객체: 1차원 배열, 1차원 ndarray와 호환
- **pandas.Series**(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)

### 2. DataFrame 객체: 2차원 배열. 서로 다른 자료형을 사용 가능. 행(인스턴스), 열(컬럼, 피쳐(feature))
- **pandas.DataFrame**(data=None, index=None, columns=None, dtype=None, copy=None)

## 2. Series 객체

### Series 객체 정의하기
- **pandas.Series**(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)

In [31]:
data = pd.Series([4, 7, -5, 3])
data

0    4
1    7
2   -5
3    3
dtype: int64

In [32]:
print(data.values)
print(data.index)
print(data.dtype)

[ 4  7 -5  3]
RangeIndex(start=0, stop=4, step=1)
int64

#### - Series  인덱스 넣어 객체 정의하기

In [72]:
data = pd.Series([4, 7, -5, 3], index=['a','b','c','d'])
data

a    4
b    7
c   -5
d    3
dtype: int64

#### - 날짜를 Series로 만들기
- pandas.date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=NoDefault.no_default, inclusive=None, **kwargs)
- https://pandas.pydata.org/docs/reference/api/pandas.date_range.html#

In [75]:
dates = pd.date_range("20130101", periods=6)

data = pd.Series(dates)

data

0   2013-01-01
1   2013-01-02
2   2013-01-03
3   2013-01-04
4   2013-01-05
5   2013-01-06
dtype: datetime64[ns]

#### - python의 dictionary 자료형을 Series data로 만들 수 있다

In [35]:
# dictionary의 key가 Series의 index가 된다
dicData = {'국어': 90, '영어': 85, '수학': 95, '과학': 75}
data = pd.Series(dicData)
data

국어    90
영어    85
수학    95
과학    75
dtype: int64

In [36]:
data.index.name = '과목'
data.name = '성적'
data

과목
국어    90
영어    85
수학    95
과학    75
Name: 성적, dtype: int64

### Series 인덱스 변경하기

In [73]:
data.index = ['A','B','C','D']
data

A    4
B    7
C   -5
D    3
dtype: int64

### Series 인덱싱

In [2]:
data = pd.Series({'국어': 90, '영어': 85, '수학': 95, '과학': 75})

data[1:2]

영어    85
dtype: int64

In [3]:
data['영어':'과학']

영어    85
수학    95
과학    75
dtype: int64

In [6]:
data[['영어','과학']]

영어    85
과학    75
dtype: int64

In [7]:
data[data > 90]

수학    95
dtype: int64

In [8]:
data[(data>80) & (data<100)]

국어    90
영어    85
수학    95
dtype: int64

### 시리즈 연산 : value에만 적용됨
- 넘파이 배열처럼 시리즈도 벡터화 연산을 할 수 있다. 
- 인덱스(index) 값은 변하지 않고, 값( value) 에만 적용된다

##### (인덱스 값이 동일한 두 개의 시리즈인 경우 연산)

In [40]:
data1 = pd.Series({'국어': 90, '영어': 85, '수학': 95, '과학': 75})
data2 = pd.Series({'국어': 80, '영어': 95, '수학': 85, '과학': 75})

data1 - data2

국어    10
영어   -10
수학    10
과학     0
dtype: int64

##### (인덱스 값이 다른 두 개의 시리즈인 일 경우 연산)

In [41]:
data1 = pd.Series({'국어': 90, '영어': 85, '수학': 95, '과학': 75})
data2 = pd.Series({'국어': 80, '영어': 95, '사회': 85})

data1 - data2

과학     NaN
국어    10.0
사회     NaN
수학     NaN
영어   -10.0
dtype: float64

### Series에 요소 추가 & 삭제

In [42]:
data = pd.Series({'국어': 90, '영어': 85, '수학': 95, '과학': 75})

# 요소 추가
data['미술'] = 100

# 요소 삭제
del data['영어']

data

국어     90
수학     95
과학     75
미술    100
dtype: int64

### [실습] Series 객체 만들기
- 시간 순서의 의미 또는 연속성을  담고 있는 시리즈 객체를 2개 만들기

In [1]:
import pandas as pd

a = list(range(1,13))
d = pd.Series(a)
d

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
dtype: int64

In [94]:
a = pd.date_range('20220101', periods=12, freq='2d')  # 2일 간격
d = pd.Series(a)
d

0    2022-01-01
1    2022-01-03
2    2022-01-05
3    2022-01-07
4    2022-01-09
5    2022-01-11
6    2022-01-13
7    2022-01-15
8    2022-01-17
9    2022-01-19
10   2022-01-21
11   2022-01-23
dtype: datetime64[ns]

In [95]:
a = pd.date_range('20220101', periods=12, freq='M') # 월간격. 단,월의 끝날 출력
d = pd.Series(a)
d

0    2022-01-31
1    2022-02-28
2    2022-03-31
3    2022-04-30
4    2022-05-31
5    2022-06-30
6    2022-07-31
7    2022-08-31
8    2022-09-30
9    2022-10-31
10   2022-11-30
11   2022-12-31
dtype: datetime64[ns]

In [96]:
a = pd.period_range(start='2022-01-01', end='2022-12-01', freq='M') # 년월만 출력
d = pd.Series(a)
d

0     2022-01
1     2022-02
2     2022-03
3     2022-04
4     2022-05
5     2022-06
6     2022-07
7     2022-08
8     2022-09
9     2022-10
10    2022-11
11    2022-12
dtype: period[M]

In [10]:
date = pd.date_range(0, periods=6, freq='3d')
date = pd.Series(date)
iris = pd.Series({'Iris-setosa':40, 'Iris-versicolor':50,'Iris-virginica':60})
iris

Iris-setosa        40
Iris-versicolor    50
Iris-virginica     60
dtype: int64

In [2]:
#1
day_count = pd.Series({'웹개발1':23, '데이터분석1':9,'프로젝트1':11, '통계패키지':11, '머신러닝딥러닝':9, '프로젝트2':11,'데이터분석2':3,'웹개발2':11, '프로젝트3':12, '기업특강':4})
day_count.name = 'k-digital 과목별 수업일수'
print(day_count)

#2
stat = pd.date_range('20220419', periods=4)
stat = pd.Series(stat)
stat.name = '통계 수업일'
print(stat)

웹개발1       23
데이터분석1      9
프로젝트1      11
통계패키지      11
머신러닝딥러닝     9
프로젝트2      11
데이터분석2      3
웹개발2       11
프로젝트3      12
기업특강        4
Name: k-digital 과목별 수업일수, dtype: int64
0   2022-04-19
1   2022-04-20
2   2022-04-21
3   2022-04-22
Name: 통계 수업일, dtype: datetime64[ns]

------

## 3. DataFrame 객체

### DataFrame 객체 만들기
- pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)

#### A. 2차원 리스트(배열)을 사용하여 생성하기

In [43]:
import numpy as np
import pandas as pd

data = [[1,2,3],[4,5,6],[7,8,9]]  # 리스트
#data = np.array(data)             # 넘파이 배열
df = pd.DataFrame(data)

# DataFrame 이름 부여하기
df.name = 'test'
df.index.name = 'index'
df.columns.name = 'num'

# index명, column명 부여하기
df.index = ['a','b','c']
df.columns = ['c1','c2','c3']
df

df

   c1  c2  c3
a   1   2   3
b   4   5   6
c   7   8   9

#### B. Python Dictionary 자료형을 사용하여 생성

In [3]:
score_table = {'성명':['BTS','아이유','원빈','블랙핑크','나'],
              '영어':[50,60,70,80,90],
              '수학':[60,50,70,70,90]}

df = pd.DataFrame(score_table)

df.name = 'Grade Card'
df.index.name = 'name'
df.columns.name = 'subject'

df

subject    성명  영어  수학
name
0         BTS  50  60
1         아이유  60  50
2          원빈  70  70
3        블랙핑크  80  70
4           나  90  90

In [4]:
df.shape

(5, 3)

### 컬럼명 인덱스명 변경하기
- 리스트나 배열을 이용하여 만든 DataFrame의 인덱스 변경은 Series에서와 동일하다.

In [105]:
data = [[1,2,3],[4,5,6],[7,8,9]]  # 리스트
df = pd.DataFrame(data, columns=['c1','c2','c3'], index=['a','b','c'])
df

   c1  c2  c3
a   1   2   3
b   4   5   6
c   7   8   9

In [106]:
df.columns = ['C1','C2','C3']
df.index = ['A','B','C']
df

   C1  C2  C3
A   1   2   3
B   4   5   6
C   7   8   9

- 단, 딕셔너리와 같이 키값이 자동으로 컬럼명으로 사용된 경우에는 동일한 키값을 컬럼명으로 사용할 경우 컬럼의 위치만 변경된다.

In [107]:
df = pd.DataFrame(score_table, columns=["영어", "수학", "성명"],
                          index=["one", "two", "three", "four", "five"])

df

       영어  수학    성명
one    50  60   BTS
two    60  50   아이유
three  70  70    원빈
four   80  70  블랙핑크
five   90  90     나

In [108]:
df = pd.DataFrame(score_table, columns=["성명", "영어", "수학"],
                          index=["one", "two", "three", "four", "five"])
df

         성명  영어  수학
one     BTS  50  60
two     아이유  60  50
three    원빈  70  70
four   블랙핑크  80  70
five      나  90  90

In [109]:
df = pd.DataFrame(score_table, columns=["C1", "C2", "C3"],
                          index=["one", "two", "three", "four", "five"])
df

        C1   C2   C3
one    NaN  NaN  NaN
two    NaN  NaN  NaN
three  NaN  NaN  NaN
four   NaN  NaN  NaN
five   NaN  NaN  NaN

### DafaFrame 복사하기

In [47]:
df2 = df             # view, 메모리 공유
df3 = df.copy()      # copy, 별도의 메모리 사용
df4 = df.iloc[:,0:2] # copy, 별도의 메모리 사용
df4

         성명  영어
one     BTS  50
two     아이유  60
three    원빈  70
four   블랙핑크  80
five      나  90

### DataFrame 행(Row) & 열(Column)에 접근하기

In [111]:
score_table = {'성명':['BTS','아이유','원빈','블랙핑크','나'],
              '영어':[50,60,70,80,90],
              '수학':[60,50,70,70,90]}

df = pd.DataFrame(score_table, index=["one", "two", "three", "four", "five"] )

df.name = 'Grade Card'
df.index.name = 'name'
df.columns.name = 'subject'

df

subject    성명  영어  수학
name
one       BTS  50  60
two       아이유  60  50
three      원빈  70  70
four     블랙핑크  80  70
five        나  90  90

#### - DataFrame의 Column(열)에 접근하기

In [120]:
df['성명']  # = 
df.loc[:,['성명']]

subject    성명
name
one       BTS
two       아이유
three      원빈
four     블랙핑크
five        나

In [121]:
df[['성명', '영어']]
df.loc[:,['성명', '영어']]

subject    성명  영어
name
one       BTS  50
two       아이유  60
three      원빈  70
four     블랙핑크  80
five        나  90

#### - DataFrame의 Row(행)에 접근하기

In [114]:
# 특정 개수만큼 행 출력
df.head(3)   # df.head(n=3)

subject   성명  영어  수학
name
one      BTS  50  60
two      아이유  60  50
three     원빈  70  70

In [115]:
# 특정 조건으로 행 검색
df.query('성명=="BTS"')

subject   성명  영어  수학
name
one      BTS  50  60

In [116]:
# 특정 조건으로 컬럼값 검색
df.query('영어 > 70')['성명']

name
four    블랙핑크
five       나
Name: 성명, dtype: object

In [127]:
# 인덱스 값이 'four'인 행
df.loc['four',:]
df.loc[['two','four'], :]

subject    성명  영어  수학
name
two       아이유  60  50
four     블랙핑크  80  70

### 데이터 변경하기

#### - 컬럼(열) 값 데이터 변경

In [53]:
import numpy as np

df['영어'] = np.mean(df['영어'])

df['영어']

one      70.0
two      70.0
three    70.0
four     70.0
five     70.0
Name: 영어, dtype: float64

#### - Row(행) 값 변경하기

In [129]:
df.loc['five',:] = ['나', 100, 100]
df

subject    성명   영어   수학
name
one       BTS   50   60
two       아이유   60   50
three      원빈   70   70
four     블랙핑크   80   70
five        나  100  100

### 추가 & 삭제

#### - 열 추가하기

In [130]:
df['국어'] = np.random.randint(100)
df

subject    성명   영어   수학  국어
name
one       BTS   50   60   4
two       아이유   60   50   4
three      원빈   70   70   4
four     블랙핑크   80   70   4
five        나  100  100   4

#### - 열 추가하기: Series 만들어서 추가하기

In [131]:
# Series를 만들어서 컬럼 추가할 수도 있다
val = pd.Series([80, 70, 90], index=['two','four','five'])

df['과학'] = val
df

subject    성명   영어   수학  국어    과학
name
one       BTS   50   60   4   NaN
two       아이유   60   50   4  80.0
three      원빈   70   70   4   NaN
four     블랙핑크   80   70   4  70.0
five        나  100  100   4  90.0

#### - 행 추가하기: 열에 값 지정해서 새로운 열 추가하기

In [136]:
df.loc['six',:] = ['유재석',90,90,100,100]
df

subject    성명     영어     수학     국어     과학
name
one       BTS   50.0   60.0    4.0    NaN
two       아이유   60.0   50.0    4.0   80.0
three      원빈   70.0   70.0    4.0    NaN
four     블랙핑크   80.0   70.0    4.0   70.0
five        나  100.0  100.0    4.0   90.0
six       유재석   90.0   90.0  100.0  100.0
6         조세호   90.0   90.0   90.0  100.0

#### - 행 추가하기: 마지막에 행 추가하기

In [137]:
df.loc[len(df)] = ['조세호',90,90,90,100]
df

subject    성명     영어     수학     국어     과학
name
one       BTS   50.0   60.0    4.0    NaN
two       아이유   60.0   50.0    4.0   80.0
three      원빈   70.0   70.0    4.0    NaN
four     블랙핑크   80.0   70.0    4.0   70.0
five        나  100.0  100.0    4.0   90.0
six       유재석   90.0   90.0  100.0  100.0
6         조세호   90.0   90.0   90.0  100.0
7         조세호   90.0   90.0   90.0  100.0

#### - 행 추가하기: append함수로 DataFrame 객체를 만들어 합치기

In [142]:
df_ = pd.DataFrame(data=[['조세호',90,90,90,100]], index=['seven'],
                  columns=df.columns)
df.append(df_)
#df.concat([df, df_])
df

subject    성명     영어     수학     국어     과학
name
one       BTS   50.0   60.0    4.0    NaN
two       아이유   60.0   50.0    4.0   80.0
three      원빈   70.0   70.0    4.0    NaN
four     블랙핑크   80.0   70.0    4.0   70.0
five        나  100.0  100.0    4.0   90.0
six       유재석   90.0   90.0  100.0  100.0
6         조세호   90.0   90.0   90.0  100.0
7         조세호   90.0   90.0   90.0  100.0

#### - 열 삭제하기

In [144]:
del df['과학']
df

subject    성명     영어     수학     국어
name
one       BTS   50.0   60.0    4.0
two       아이유   60.0   50.0    4.0
three      원빈   70.0   70.0    4.0
four     블랙핑크   80.0   70.0    4.0
five        나  100.0  100.0    4.0
six       유재석   90.0   90.0  100.0
6         조세호   90.0   90.0   90.0
7         조세호   90.0   90.0   90.0

#### - 행(특정 행) 삭제하기

In [145]:
df.drop(['six'])
df.drop([7])

subject    성명     영어     수학     국어
name
one       BTS   50.0   60.0    4.0
two       아이유   60.0   50.0    4.0
three      원빈   70.0   70.0    4.0
four     블랙핑크   80.0   70.0    4.0
five        나  100.0  100.0    4.0
six       유재석   90.0   90.0  100.0
6         조세호   90.0   90.0   90.0

### 파일 읽어오기

#### - txt 파일 읽어오기

In [12]:
import pandas as pd

# 방법1
df = pd.read_table('data/data.txt', names=['숫자'])

# 방법2
df = pd.read_table('data/data.txt', header=None)
df.columns = ['숫자']

df

   숫자
0  91
1  91
2  54
3  47
4  88
5  87
6  84
7  97
8  70
9  82

In [13]:
# 방법1
df = pd.read_table('data/book.txt', sep=',', 
                  names = ['제목','영어제목','저자','국적','출판년도'])

# 방법2
df = pd.read_table('data/book.txt', sep=',', header=None)
df.columns = ['제목','영어제목','저자','국적','출판년도']
df

            제목                      영어제목            저자    국적         출판년도
0     두 도시 이야기      A Tale of Two Cities        찰스 디킨스    영어         1859
1        어린 왕자           Le Petit Prince   앙투안 드 생텍쥐페리  프랑스어         1943
2       반지의 제왕     The Lord of the Rings   J. R. R. 톨킨    영어  1954 ~ 1955
3  그리고 아무도 없었다  And Then There Were None      애거사 크리스티    영어         1939
4           호빗                The Hobbit   J. R. R. 톨킨    영어         1937

#### - csv 파일 읽어오기

pd.read_csv() 사용 <br>

- 맥은 utf-8 방식을 쓰고 윈도우는 cp949 방식 사용
- 한글 인코딩: Microsoft사에서 만든 cp949/ms949 인코딩, euc-kr인코딩, utf-8 인코딩 등등
-- 해결책 (1) - engine='python'
-- 해결책 (2) - encoding='utf-8' 
-- 해결책 (3) - encoding='cp949'  # 한글이 깨지거나 읽을 때 오류가 발생한다면
-- 해결책 (4) - Excel에서 인코딩 옵션 변경 (다른 이름으로 저장에서 - CSV UTF-8 (쉼표로 분리) 로 변경하여 저장)

In [153]:
import pandas as pd

df = pd.read_csv('data/iris.csv')
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

#### - Remote URL에서 읽어오기

In [3]:
file = 'https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'

df = pd.read_csv(file, header=None) # 첫번째 행 컬럼으로 인식 안하도록
df

       0    1    2    3               4
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

### [실습]  외부 데이터 읽어와  행&열 추가 및 삭제 실습하기

- 각자 자유롭게 진행하기

In [1]:
import pandas as pd

df = pd.read_csv('data/인구밀도_인구주택총조사기준__20220703164053.csv', encoding='cp949')
df

      행정구역별     2018     2019     2020
0        전국    514.4    515.7    516.2
1     서울특별시  15983.7  15926.9  15839.0
2     부산광역시   4409.8   4379.7   4348.9
3     대구광역시   2766.7   2750.3   2728.6
4     인천광역시   2761.4   2776.6   2765.1
5     광주광역시   2973.2   2972.7   2948.5
6     대전광역시   2801.0   2777.5   2758.1
7     울산광역시   1083.4   1076.9   1069.0
8   세종특별자치시    671.9    727.3    761.3
9       경기도   1286.2   1305.0   1325.3
10      강원도     90.3     90.3     90.4
11     충청북도    218.8    220.0    220.3
12     충청남도    265.1    265.4    264.0
13     전라북도    225.3    224.0    223.4
14     전라남도    145.0    144.8    144.9
15     경상북도    140.4    140.2    138.9
16     경상남도    317.9    317.6    316.2
17      제주도    355.8    359.4    362.6

#### - 데이터 가공하기

In [2]:
# (앞에서 사용한) 인구밀도 데이터 가공하기
df['2021'] = df['2020'] + df['2020'] * 0.1  # 2021 컬럼 추가

df['평균'] = df.mean(axis=1, numeric_only=True)

df

      행정구역별     2018     2019     2020      2021          평균
0        전국    514.4    515.7    516.2    567.82    528.5300
1     서울특별시  15983.7  15926.9  15839.0  17422.90  16293.1250
2     부산광역시   4409.8   4379.7   4348.9   4783.79   4480.5475
3     대구광역시   2766.7   2750.3   2728.6   3001.46   2811.7650
4     인천광역시   2761.4   2776.6   2765.1   3041.61   2836.1775
5     광주광역시   2973.2   2972.7   2948.5   3243.35   3034.4375
6     대전광역시   2801.0   2777.5   2758.1   3033.91   2842.6275
7     울산광역시   1083.4   1076.9   1069.0   1175.90   1101.3000
8   세종특별자치시    671.9    727.3    761.3    837.43    749.4825
9       경기도   1286.2   1305.0   1325.3   1457.83   1343.5825
10      강원도     90.3     90.3     90.4     99.44     92.6100
11     충청북도    218.8    220.0    220.3    242.33    225.3575
12     충청남도    265.1    265.4    264.0    290.40    271.2250
13     전라북도    225.3    224.0    223.4    245.74    229.6100
14     전라남도    145.0    144.8    144.9    159.39    148.5225
15     경상북도    140.4    140.2    138.9    152.79    143.0725
16     경상남도    317.9    317.6    316.2    347.82    324.8800
17      제주도    355.8    359.4    362.6    398.86    369.1650

### [실습] 사이킷런 데이터셋을 DateFrame으로 만들기

In [14]:
from sklearn.datasets import load_iris

iris = load_iris()
iris

{'data': array([[5.1, 3.5, 1.4, 0.2],
        [4.9, 3. , 1.4, 0.2],
        [4.7, 3.2, 1.3, 0.2],
        [4.6, 3.1, 1.5, 0.2],
        [5. , 3.6, 1.4, 0.2],
        [5.4, 3.9, 1.7, 0.4],
        [4.6, 3.4, 1.4, 0.3],
        [5. , 3.4, 1.5, 0.2],
        [4.4, 2.9, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.1],
        [5.4, 3.7, 1.5, 0.2],
        [4.8, 3.4, 1.6, 0.2],
        [4.8, 3. , 1.4, 0.1],
        [4.3, 3. , 1.1, 0.1],
        [5.8, 4. , 1.2, 0.2],
        [5.7, 4.4, 1.5, 0.4],
        [5.4, 3.9, 1.3, 0.4],
        [5.1, 3.5, 1.4, 0.3],
        [5.7, 3.8, 1.7, 0.3],
        [5.1, 3.8, 1.5, 0.3],
        [5.4, 3.4, 1.7, 0.2],
        [5.1, 3.7, 1.5, 0.4],
        [4.6, 3.6, 1. , 0.2],
        [5.1, 3.3, 1.7, 0.5],
        [4.8, 3.4, 1.9, 0.2],
        [5. , 3. , 1.6, 0.2],
        [5. , 3.4, 1.6, 0.4],
        [5.2, 3.5, 1.5, 0.2],
        [5.2, 3.4, 1.4, 0.2],
        [4.7, 3.2, 1.6, 0.2],
        [4.8, 3.1, 1.6, 0.2],
        [5.4, 3.4, 1.5, 0.4],
        [5.2, 4.1, 1.5, 0.1],
        [5.5, 4.2, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.2],
        [5. , 3.2, 1.2, 0.2],
        [5.5, 3.5, 1.3, 0.2],
        [4.9, 3.6, 1.4, 0.1],
        [4.4, 3. , 1.3, 0.2],
        [5.1, 3.4, 1.5, 0.2],
        [5. , 3.5, 1.3, 0.3],
        [4.5, 2.3, 1.3, 0.3],
        [4.4, 3.2, 1.3, 0.2],
        [5. , 3.5, 1.6, 0.6],
        [5.1, 3.8, 1.9, 0.4],
        [4.8, 3. , 1.4, 0.3],
        [5.1, 3.8, 1.6, 0.2],
        [4.6, 3.2, 1.4, 0.2],
        [5.3, 3.7, 1.5, 0.2],
        [5. , 3.3, 1.4, 0.2],
        [7. , 3.2, 4.7, 1.4],
        [6.4, 3.2, 4.5, 1.5],
        [6.9, 3.1, 4.9, 1.5],
        [5.5, 2.3, 4. , 1.3],
        [6.5, 2.8, 4.6, 1.5],
        [5.7, 2.8, 4.5, 1.3],
        [6.3, 3.3, 4.7, 1.6],
        [4.9, 2.4, 3.3, 1. ],
        [6.6, 2.9, 4.6, 1.3],
        [5.2, 2.7, 3.9, 1.4],
        [5. , 2. , 3.5, 1. ],
        [5.9, 3. , 4.2, 1.5],
        [6. , 2.2, 4. , 1. ],
        [6.1, 2.9, 4.7, 1.4],
        [5.6, 2.9, 3.6, 1.3],
        [6.7, 3.1, 4.4, 1.4],
        [5.6, 3. , 4.5, 1.5],
        [5.8, 2.7, 4.1, 1. ],
        [6.2, 2.2, 4.5, 1.5],
        [5.6, 2.5, 3.9, 1.1],
        [5.9, 3.2, 4.8, 1.8],
        [6.1, 2.8, 4. , 1.3],
        [6.3, 2.5, 4.9, 1.5],
        [6.1, 2.8, 4.7, 1.2],
        [6.4, 2.9, 4.3, 1.3],
        [6.6, 3. , 4.4, 1.4],
        [6.8, 2.8, 4.8, 1.4],
        [6.7, 3. , 5. , 1.7],
        [6. , 2.9, 4.5, 1.5],
        [5.7, 2.6, 3.5, 1. ],
        [5.5, 2.4, 3.8, 1.1],
        [5.5, 2.4, 3.7, 1. ],
        [5.8, 2.7, 3.9, 1.2],
        [6. , 2.7, 5.1, 1.6],
        [5.4, 3. , 4.5, 1.5],
        [6. , 3.4, 4.5, 1.6],
        [6.7, 3.1, 4.7, 1.5],
        [6.3, 2.3, 4.4, 1.3],
        [5.6, 3. , 4.1, 1.3],
        [5.5, 2.5, 4. , 1.3],
        [5.5, 2.6, 4.4, 1.2],
        [6.1, 3. , 4.6, 1.4],
        [5.8, 2.6, 4. , 1.2],
        [5. , 2.3, 3.3, 1. ],
        [5.6, 2.7, 4.2, 1.3],
        [5.7, 3. , 4.2, 1.2],
        [5.7, 2.9, 4.2, 1.3],
        [6.2, 2.9, 4.3, 1.3],
        [5.1, 2.5, 3. , 1.1],
        [5.7, 2.8, 4.1, 1.3],
        [6.3, 3.3, 6. , 2.5],
        [5.8, 2.7, 5.1, 1.9],
        [7.1, 3. , 5.9, 2.1],
        [6.3, 2.9, 5.6, 1.8],
        [6.5, 3. , 5.8, 2.2],
        [7.6, 3. , 6.6, 2.1],
        [4.9, 2.5, 4.5, 1.7],
        [7.3, 2.9, 6.3, 1.8],
        [6.7, 2.5, 5.8, 1.8],
        [7.2, 3.6, 6.1, 2.5],
        [6.5, 3.2, 5.1, 2. ],
        [6.4, 2.7, 5.3, 1.9],
        [6.8, 3. , 5.5, 2.1],
        [5.7, 2.5, 5. , 2. ],
        [5.8, 2.8, 5.1, 2.4],
        [6.4, 3.2, 5.3, 2.3],
        [6.5, 3. , 5.5, 1.8],
        [7.7, 3.8, 6.7, 2.2],
        [7.7, 2.6, 6.9, 2.3],
        [6. , 2.2, 5. , 1.5],
        [6.9, 3.2, 5.7, 2.3],
        [5.6, 2.8, 4.9, 2. ],
        [7.7, 2.8, 6.7, 2. ],
        [6.3, 2.7, 4.9, 1.8],
        [6.7, 3.3, 5.7, 2.1],
        [7.2, 3.2, 6. , 1.8],
        [6.2, 2.8, 4.8, 1.8],
        [6.1, 3. , 4.9, 1.8],
        [6.4, 2.8, 5.6, 2.1],
        [7.2, 3. , 5.8, 1.6],
        [7.4, 2.8, 6.1, 1.9],
        [7.9, 3.8, 6.4, 2. ],
        [6.4, 2.8, 5.6, 2.2],
        [6.3, 2.8, 5.1, 1.5],
        [6.1, 2.6, 5.6, 1.4],
        [7.7, 3. , 6.1, 2.3],
        [6.3, 3.4, 5.6, 2.4],
        [6.4, 3.1, 5.5, 1.8],
        [6. , 3. , 4.8, 1.8],
        [6.9, 3.1, 5.4, 2.1],
        [6.7, 3.1, 5.6, 2.4],
        [6.9, 3.1, 5.1, 2.3],
        [5.8, 2.7, 5.1, 1.9],
        [6.8, 3.2, 5.9, 2.3],
        [6.7, 3.3, 5.7, 2.5],
        [6.7, 3. , 5.2, 2.3],
        [6.3, 2.5, 5. , 1.9],
        [6.5, 3. , 5.2, 2. ],
        [6.2, 3.4, 5.4, 2.3],
        [5.9, 3. , 5.1, 1.8]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 'frame': None,
 'target_names': array(['setosa', 'versicolor', 'virginica'], dtype='<U10'),
 'DESCR': '.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n                \n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n.. topic:: References\n\n   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...',
 'feature_names': ['sepal length (cm)',
  'sepal width (cm)',
  'petal length (cm)',
  'petal width (cm)'],
 'filename': 'iris.csv',
 'data_module': 'sklearn.datasets.data'}

In [10]:
from sklearn.datasets import load_iris

iris = load_iris()
iris
df = pd.DataFrame(iris.data, columns=iris.feature_names)
df['target'] = iris.target 
df['target_name'] = iris.target_names[iris.target]
df.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target,target_name
0,5.1,3.5,1.4,0.2,0,setosa
1,4.9,3.0,1.4,0.2,0,setosa
2,4.7,3.2,1.3,0.2,0,setosa
3,4.6,3.1,1.5,0.2,0,setosa
4,5.0,3.6,1.4,0.2,0,setosa

### 파일 저장하기
- 해당 위치에 파일이 생성되었는지 확인한다.

In [11]:
file = 'data/iris.csv' 
df.to_csv(file, index=False)

### DataFrame 그룹핑하기

In [12]:
import pandas as pd

df = pd.read_csv('data/iris.csv')
df.head(2)

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target,target_name
0,5.1,3.5,1.4,0.2,0,setosa
1,4.9,3.0,1.4,0.2,0,setosa

#### 컬럼에 대해 aggreation 그룹핑하기

In [7]:
df.agg({'sepal length (cm)' : ['mean', 'min'], 
        'sepal width (cm)' : ['min', 'max']})

      sepal length (cm)  sepal width (cm)
mean           5.843333               NaN
min            4.300000               2.0
max                 NaN               4.4

#### 특정 컬럼 기준으로 평균 값으로 그룹핑하기

In [5]:
df.groupby(['target_name', 'target']).mean()

,,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
target_name,target,,,,
setosa,0,5.006,3.428,1.462,0.246
versicolor,1,5.936,2.770,4.260,1.326
virginica,2,6.588,2.974,5.552,2.026

---------

### [실습문제] 색상 파일 읽어서 이미지의 특정 색상 값 출력하기  - color detection

- 색상정보 파일 : color.csv
- 이미지 파일 : colorpic.jpg

In [1]:
import cv2
import sys
import numpy as np
import pandas as pd

# opencv로 이미지 파일 불러오기
img_path = 'image/colorpic.jpg'
img = cv2.imread(img_path)
if img is None:
    print('Image load failed')
    sys.exit()

# 변수 선언
clicked = False
r = g = b = xpos = ypos = 0

# 색상정보 파일 불러오기
file_path = 'data/colors.csv'
index=["color","color_name","hex","R","G","B"]
csv = pd.read_csv(file_path, names=index, header=None)

# 색상정보 출력하기
csv

                    color             color_name      hex    R    G    B
0      air_force_blue_raf   Air Force Blue (Raf)  #5d8aa8   93  138  168
1     air_force_blue_usaf  Air Force Blue (Usaf)  #00308f    0   48  143
2    air_superiority_blue   Air Superiority Blue  #72a0c1  114  160  193
3         alabama_crimson        Alabama Crimson  #a32638  163   38   56
4              alice_blue             Alice Blue  #f0f8ff  240  248  255
..                    ...                    ...      ...  ...  ...  ...
860         yellow_orange          Yellow Orange  #ffae42  255  174   66
861        yellow_process       Yellow (Process)  #ffef00  255  239    0
862            yellow_ryb           Yellow (Ryb)  #fefe33  254  254   51
863                zaffre                 Zaffre  #0014a8    0   20  168
864     zinnwaldite_brown      Zinnwaldite Brown  #2c1608   44   22    8

[865 rows x 6 columns]

In [2]:
# 색상 정보 추출 함수
def getColorName(R,G,B):
    minimum = 10000
    for i in range(len(csv)):
        d = abs(R- int(csv.loc[i,"R"])) + abs(G- int(csv.loc[i,"G"]))+ abs(B- int(csv.loc[i,"B"]))
        if(d<=minimum):
            minimum = d
            cname = csv.loc[i,"color_name"]
    return cname

# 마우스로 더블 클릭한 위치(x, y)의 픽셀 값 얻기 
def draw_function(event, x,y,flags,param):
    if event == cv2.EVENT_LBUTTONDBLCLK:
        global b,g,r,xpos,ypos, clicked
        clicked = True
        xpos = x
        ypos = y
        b,g,r = img[y,x]  # opencv는 rgb순서가 아닌 bgr순서임
        b = int(b)
        g = int(g)
        r = int(r)

--[공통] ------------------------

In [3]:
# 윈도우 만들기
cv2.namedWindow('image')
# 마우스 콜백 함수 호출하기
cv2.setMouseCallback('image',draw_function)

while True:

    cv2.imshow("image",img)
    if (clicked):
        # 색상값 출력할 박스 그리기(-1:색칠하기)
        #cv2.rectangle(image, startpoint, endpoint, color, thickness)-1 fills entire rectangle 
        cv2.rectangle(img,(20,20), (750,60), (b,g,r), -1)

        # 글자 쓰기
        #Creating text string to display( Color name and RGB values )
        #cv2.putText(img,text,start,font(0-7),fontScale,color,thickness,lineType )
        text = getColorName(r,g,b) + ' R='+ str(r) +  ' G='+ str(g) +  ' B='+ str(b)
        cv2.putText(img, text,(50,50),2,0.8,(255,255,255),2,cv2.LINE_AA)

        # r+g+b>=600(밝은 색상 컬러는) 검은색 글씨로 
        #For very light colours we will display text in black colour
        if(r+g+b>=600):
            cv2.putText(img, text,(50,50),2,0.8,(0,0,0),2,cv2.LINE_AA)
            
        clicked=False

    # ESC키를 누르면 화면 닫기  
    if cv2.waitKey(20) & 0xFF ==27:
        break
    
cv2.destroyAllWindows()

### [응용] TTS  기능 추가하기
- 윈도우 OS에서만 가능하다.
- 시간차가 있어 약간 실행 속도가 늦다

#### pywin32 라이브러리 설치하기

In [ ]:
!pip install pywin32

#### TTS 기능 추가하기

In [4]:
import win32com.client

# win TTS 사용
tts = win32com.client.Dispatch("SAPI.SpVoice")
# tts.Speak("마스크를 착용해 주세요")

# 윈도우 만들기
cv2.namedWindow('image')
# 마우스 콜백 함수 호출하기
cv2.setMouseCallback('image',draw_function)

while True:
    cv2.imshow("image",img)
    
    if (clicked):
        # 색상값 출력할 박스 그리기(-1:색칠하기)
        #cv2.rectangle(image, startpoint, endpoint, color, thickness)-1 fills entire rectangle 
        cv2.rectangle(img,(20,20), (750,60), (b,g,r), -1)

        # 글자 쓰기
        #Creating text string to display( Color name and RGB values )
        #cv2.putText(img,text,start,font(0-7),fontScale,color,thickness,lineType )
        color = getColorName(r,g,b)
        text = color + ' R='+ str(r) +  ' G='+ str(g) +  ' B='+ str(b)
        cv2.putText(img, text,(50,50),2,0.8,(255,255,255),2,cv2.LINE_AA)

        # r+g+b>=600(밝은 색상 컬러는) 검은색 글씨로 
        #For very light colours we will display text in black colour
        if(r+g+b>=600):
            cv2.putText(img, text,(50,50),2,0.8,(0,0,0),2,cv2.LINE_AA)
            
        clicked=False
        
        # 색상 읽어주기
        tts.Speak(color)
        
    
    # ESC키를 누르면 화면 닫기  
    if cv2.waitKey(20) & 0xFF ==27:
        break
    
cv2.destroyAllWindows()

----------------------

## [실습] Mito를 이용한 Spreadsheet 맛보기

### Doc : https://docs.trymito.io/

https://docs.trymito.io/how-to/creating-a-mitosheet

### 라이브러리 설치하기

#### 인스톨러 다운로드

In [ ]:
!python -m pip install mitoinstaller

#### 인스톨러 설치하기 [주의!] (PC 명령프롬프트 창에서 실행시킨다.)

In [ ]:
#python -m mitoinstaller install

### mito 사용하기
- python -m mitoinstaller install  명령어를 실행시키면 뜨는 주피터 노트북 창에서만 코드 실행 가능하다

In [ ]:
import mitosheet
# mitosheet.sheet()
mitosheet.sheet(analysis_to_replay="id-xfxdrmlqcu")

--------------

끝